https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf

https://dataitgirls2.github.io/10minutes2pandas/

https://www.youtube.com/watch?v=lspu830SzC8

In [2]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [3]:
s = pd.Series([1, 3, 4, np.nan, 6, 8])

In [4]:
s

0    1.0
1    3.0
2    4.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [5]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01 -0.998999  1.124950 -2.913553  1.439190
2013-01-02  1.195372  0.819880 -0.259977  0.701104
2013-01-03 -0.123910 -0.527360 -0.566370  0.618631
2013-01-04  0.285751 -1.069195  1.046344 -0.637556
2013-01-05 -0.056270 -1.290708  0.598423 -1.188474
2013-01-06 -0.995812 -0.742683  0.652860 -0.740987

In [8]:
df2 = pd.DataFrame({'A' : 1.,
                    'B' : pd.Timestamp('20130102'),
                    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
                    'D' : np.array([3] * 4,dtype='int32'),
                    'E' : pd.Categorical(["test","train","test","train"]),
                    'F' : 'foo' })
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [9]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [10]:
df = pd.DataFrame({"a": [4, 5, 6],
                  "b": [7, 8, 9],
                  "c": [10, 11, 12]},
                 index = [1, 2, 3])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [12]:
df = pd.DataFrame(
[[4, 7, 10],
[5, 8, 11],
[6, 9, 12]],
index=[1, 2, 3],
columns=['a', 'b', 'c'])
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [17]:
df = pd.DataFrame(
{"a" : [4 ,5, 6],
"b" : [7, 8, 9],
"c" : [10, 11, 12]}, 
    index = pd.MultiIndex.from_tuples(
[('d',1),('d',2),('e',2)],
names=['n','v']))
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [21]:
df[df.a < 7]

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12

In [23]:
df[df.b > 7]

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12

In [26]:
df.head(2)

     a  b   c
n v
d 1  4  7  10
  2  5  8  11

In [27]:
df.tail(2)

     a  b   c
n v
d 2  5  8  11
e 2  6  9  12

In [28]:
df["b"] != 7

n  v
d  1    False
   2     True
e  2     True
Name: b, dtype: bool

In [36]:
df.a.isin([4])

n  v
d  1     True
   2    False
e  2    False
Name: a, dtype: bool

In [37]:
df = pd.DataFrame({'a': [1, 10, 8, 11, -1],
               'b': list('abcde'),
               'c': [1.0, 2.0, np.nan, 3.0, 4.0]})

In [38]:
df

    a  b    c
0   1  a  1.0
1  10  b  2.0
2   8  c  NaN
3  11  d  3.0
4  -1  e  4.0

In [39]:
df.nlargest(1, 'a')

    a  b    c
3  11  d  3.0

In [42]:
df.nlargest(2, 'c')

    a  b    c
4  -1  e  4.0
3  11  d  3.0

In [43]:
df.nsmallest(2, 'a')

   a  b    c
4 -1  e  4.0
0  1  a  1.0

In [45]:
import seaborn as sns

In [ ]:
df = sns.load_dataset('iris')